RxSystemServicesImpl.setEnvVar(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Set environment variable with new value.

RxSystemServicesImpl.getEnvVar(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdString*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Get environment variable. If varName doesn't exist, returns eKeyNotFound.

RxSystemServicesImpl.setSystemCodePage(OdCodePageId)
\details
Sets the system code page.
\param codePage [in]  CodePage.

RxSystemServicesImpl.systemCodePage
\details
Returns the system code page.
\remarks
On Windows platforms system code page is initialized based on computer's
Regional Settings. On other platforms with CP_UNDEFINED.
It can be altered by setSystemCodePage()